let scheme = {
    а: ['a', 1072, 1040],
    б: ['b', 1073, 1041],
    в: ['v', 1074, 1042],
    г: ['g', 1075, 1043],
    д: ['d', 1076, 1044],
    е: ['e', 1077, 1045],
    ё: ['e', 1105, 1025],
    ж: ['zh', 1078, 1046],
    з: ['z', 1079, 1047],
    и: ['i', 1080, 1048],
    й: ['i', 1081, 1049],
    к: ['k', 1082, 1050],
    л: ['l', 1083, 1051],
    м: ['m', 1084, 1052],
    н: ['n', 1085, 1053],
    о: ['o', 1086, 1054],
    п: ['p', 1087, 1055],
    р: ['r', 1088, 1056],
    с: ['s', 1089, 1057],
    т: ['t', 1090, 1058],
    у: ['u', 1091, 1059],
    ф: ['f', 1092, 1060],
    х: ['kh', 1093, 1061],
    ц: ['ts', 1094, 1062],
    ч: ['ch', 1095, 1063],
    ш: ['sh', 1096, 1064],
    щ: ['shch', 1097, 1065],
    ъ: ['ie', 1098, 1066],
    ы: ['y', 1099, 1067],
    ь: ['', 1100, 1068],
    э: ['e', 1101, 1069],
    ю: ['iu', 1102, 1070],
    я: ['ia', 1103, 1071]
};

const Translit = (value) => {
    value = value.toLowerCase();
    let result = [];

    for (let i in value) {
        if (scheme[value[i]]) result.push(scheme[value[i]][0]);
        else result.push(value[i]);
    }

    result = result.join('').replaceAll(" ", "_")
    return result
};

export default Translit;
